/*
 * tk_wh1602b3.h
 *
 *  Created on: 7 лист. 2017 р.
 *      Author: KozakVF
 */


//
#include "tkConfig.h"
#ifdef WINSTAR_Display_WH1602B3
#ifndef LCD_WH1602B3_H_
#define LCD_WH1602B3_H_


#include <stdint.h>
/*******************************************************************************************************************
 *******************************************************************************************************************
 *     P U B L I C    V A R I A B L E S
 *******************************************************************************************************************
*/

typedef enum {              /* Статус, коди завершення функцій бібліотеки 									*/
	WH1602B3_OK,			/* OK, без коментарів															*/
	WH1602B3_UNKNOWN_Err,	/* невизначена помилка 															*/
	WH1602B3_I2C_Err,		/* помилка транспортування даних по I2C 										*/
	WH1602B3_BUSY,
	WH1602B3_WRONG_Arg,		/* на вході функції некоректні аргументи, отже і функції щось робила некоректно */
	WH1602B3_NULL_Ptr,		/* нульовий показчик (рос. - указатель), аврійне припинення роботи 				*/
	WH1602B3_Err			/* помилка при виконання функції, щось не так.. 								*/
} wh1602b3_status_t;

/* Ініціалізація після запуску контролера */
wh1602b3_status_t WH1602b3_Init ( void );

/* Друк на дисплеї верхнього/нихнього рядка
 * str - показчик на рядок,
 * якщо рядок довший ніж 16 символів - автоматично обрізується до 16 символів
 * якщо рядок коротший ніж шіснадцять символів -решта символів - пробіли ,
 * Приклад: вивести на дісплей температуру у форматі "t = 273.0 град",
 * тепература - це АЦП float value_t = 273.4
		   float value_t =273.4;
		   uint32_t d = (uint32_t)(value_t*10);
		   uint32_t P=d/10;
		   uint32_t p=d%10;
		   uint8_t tmp_str[17]={0};
		   snprintf(tmp_str, 17, "t = %3d.%1d град",P,p);(#include "string.h")
		   WH1602b3_WriteHighString(tmp_str); */
wh1602b3_status_t WH1602b3_WriteHighString(uint8_t *str);
wh1602b3_status_t WH1602b3_WriteLowString(uint8_t *str);

/* Друк частини рядка
 * х = 0..16 - номер символа в рядку з якого починається друк
 * у = 0..1  - 0- верхній рядок, 1 - нижній рядок
 * size - кількість символів для друку
 * syllable - показчик на частинку рядка для друку
 * решта символів у рядку залишаються без змін            */

wh1602b3_status_t WH1602b3_WriteSyllable(uint8_t x, uint8_t y, uint8_t size, uint8_t *syllable);
/* Друк окремого символа */
wh1602b3_status_t WH1602b3_WriteChar(uint8_t ch);
/* Очистка екрана */
wh1602b3_status_t WH1602b3_ClearScreen (void);
/* Переміщення невидимого курсора */
wh1602b3_status_t WH1602b3_SetCursor(uint8_t x, uint8_t y);
#endif /* LCD_WH1602B3_H_ */

#endif //WINSTAR_Display_WH1602B3
