/*
 * pr_MBRTU_SLAVE.h
 *
 *  Created on: 26 груд. 2018 р.
 *      Author: KozakVF
 */

#ifndef TKSUBPROJECTS_PR_MBRTU_SLAVE_H_
#define TKSUBPROJECTS_PR_MBRTU_SLAVE_H_

/* Ця функція здійснює обробку вхідного повідомлення Modbus RTU
 * згідно з логікою прикладного процесу
 * Функція викликається з функцї MB_Slave_Handling (), файл mb_slave5.h,
 * якщо байт адреси у повідомленні співпадає з адресою нашого контролера та
 * якщо півпав CRC.
 * Кількість байт в отриманому повідомленні - з урахуванням байта адреси і двох байт СКС
 * При формуванні відповіді адреса клієнта і СRC формуються у викликаючій функції,
 * кількість байт у відповіді указувати з урахуванням адреси клієнта і СRC                      */
void MB_Slave_Selective_Handler(uint8_t *rx_msg,        /* отримане повідомлення 				*/
								uint8_t rx_msg_length,  /* кількість байт в отр.повідомл.		*/
								uint8_t *tx_msg,	    /* повідомлення для відповіді    		*/
								uint8_t *tx_msg_length);/*довжина повідомлення для відповіді	*/

/* Ця функція здійснює обробку вхідного повідомлення Modbus RTU
 * згідно з логікою прикладного процесу
 * Функція викликається з функцї MB_Slave_Handling (), файл mb_slave5.h,
 * якщо байт адреси у повідомленні 0х00 (циркулярне повідомлення та якщо півпав CRC.
 * Кількість байт в отриманому повідомленні - з урахуванням байта адреси і двох байт СКС
 * Надсилання відповіді протоколом Modbus не передбачається										*/
void MB_Slave_Broadcast_Handler(uint8_t *rx_msg,		/* отримане повідомлення 				*/
								uint8_t rx_msg_length); /* кількість байт в отр.повідомл.		*/


#endif /* TKSUBPROJECTS_PR_MBRTU_SLAVE_H_ */
